Revit 2027 API
DuctSettings Properties
The DuctSettings type exposes the following members.
Properties
Name | Description
AirDensity |  The air density in kg/ft^3.
AirDynamicViscosity |  The dynamic viscosity of air in kg/(ft*s).
AssemblyInstanceId |  The id of the assembly instance to which the element belongs.
(Inherited from Element)
BoundingBox | Retrieves a box that circumscribes all geometry of the element.
(Inherited from Element)
Category | Retrieves a Category object that represents the category or sub category in which the element resides.
(Inherited from Element)
Centerline |  The abbreviation of the Centerline (=) string.
ConnectorSeparator |  The duct connector separator string.
CreatedPhaseId |  Id of a Phase at which the Element was created.
(Inherited from Element)
DemolishedPhaseId |  Id of a Phase at which the Element was demolished.
(Inherited from Element)
DesignOption | Returns the design option to which the element belongs.
(Inherited from Element)
Document | Returns the Document in which the Element resides.
(Inherited from Element)
FittingAngleUsage |  Determine how to use fitting angle during duct layout or modifying layout.
FittingAnnotationSize |  The value of fitting annotation size.
FlatOnBottom |  The abbreviation of the Flat On Bottom (FOB) string.
FlatOnTop |  The abbreviation of the Flat On Top (FOT) string.
Geometry | Retrieves the geometric representation of the element.
(Inherited from Element)
GroupId |  The id of the group to which an element belongs.
(Inherited from Element)
Id |  A unique identifier for an Element in an Autodesk Revit project.
(Inherited from Element)
IsModifiable |  Identifies if the element is modifiable.
(Inherited from Element)
IsTransient |  Indicates whether an element is transient or permanent.
(Inherited from Element)
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from Element)
LevelId |  The id of the level associated with the element.
(Inherited from Element)
Location | This property is used to find the physical location of an element within a project.
(Inherited from Element)
Name | A human readable name for the Element.
(Inherited from Element)
NetworkBasedCalculations |  Indicates whether to enable network based calculations for duct networks.
OvalDuctSizeSeparator |  The oval duct size separator string.
OvalDuctSizeSuffix |  The oval duct size suffix string.
OwnerViewId |  The id of the view that owns the element.
(Inherited from Element)
Parameter[BuiltInParameter] | Retrieves a parameter from the element given a parameter id.
(Inherited from Element)
Parameter[Definition] | Retrieves a parameter from the element based on its definition.
(Inherited from Element)
Parameter[Guid] | Retrieves a parameter from the element given a GUID for a shared parameter.
(Inherited from Element)
Parameters | Retrieves a set containing all of the parameters that are contained within the element.
(Inherited from Element)
ParametersMap | Retrieves a map containing all of the parameters that are contained within the element.
(Inherited from Element)
Pinned |  Identifies if the element has been pinned to prevent changes.
(Inherited from Element)
RectangularDuctSizeSeparator |  The rectangular duct size separator string.
RectangularDuctSizeSuffix |  The rectangular duct size suffix string.
RiseDropAnnotationSize |  The rise drop annotation size.
RoundDuctSizePrefix |  The round duct size prefix string.
RoundDuctSizeSuffix |  The round duct size suffix string.
SetDown |  The abbreviation of the Set Down from top (TD) of fitting string.
SetDownFromBottom |  The abbreviation of the Set Down from bottom (BD) of fitting string.
SetUp |  The abbreviation of the Set Up from top (TU) of fitting string.
SetUpFromBottom |  The abbreviation of the Set Up from bottom (BU) of fitting string.
UniqueId |  A stable unique identifier for an element within the document.
(Inherited from Element)
UseAnnotationScaleForSingleLineFittings |  Indicates whether use annotation scale for single line fittings or not.
VersionGuid |  Get the element version Guid.
(Inherited from Element)
ViewSpecific |  Identifies if the element is owned by a view.
(Inherited from Element)
WorksetId |  Get Id of the Workset which owns the element.
(Inherited from Element)
Top
See Also
Reference
DuctSettings Class
Autodesk.Revit.DB.Mechanical Namespace